select * from user1;
select * from product;
select * from order1;

/*
1001	boung	4192	1	28400	배송완료	010-5555-5555	한진택배	경기도 고양시 일산서구	h123456
1002	doung	8162	2	19800	배송완료	010-1111-1111	CJ대한통운	경기도 고양시 일산동구	c456789
1003	coung	5072	1	13900	배송중	010-2222-2222	롯데택배	경기도 파주시 문산읍	l123789
1004	koung	8138	3	15900	배송준비중	010-4444-4444	ㅡ	경기도 파주시 월롱면	ㅡ
*/

insert into order1 values('1001', 'boung', '4192', default, '28400',sysdate, '배송완료', '010-5555-5555', '한진택배', '경기도 고양시 일산서구', 'h123456');
insert into order1 values('1002', 'doung', '8162', '2', '19800',sysdate, '배송완료', '010-1111-1111', 'CJ대한통운', '경기도 고양시 일산동구', 'c456789');
insert into order1 values('1003', 'coung', '5072', default, '13900',sysdate, '배송중', '010-2222-2222', '롯데택배', '경기도 파주시 문산읍', '1123789');
insert into order1 values('1004', 'koung', '8138', '3', '15900',sysdate, '배송준비중', '010-4444-4444', '', '경기도 파주시 월롱면', '');

select * from basket;
/*
장바구니			
순번	아이디	상품코드	수량
10001	doung	6186	1
10002	koung	1352	2
10003	aoung	5072	1
10004	coung	8162	3
*/
insert into basket values('10001', 'doung', '6186', '1');
insert into basket values('10002', 'koung', '1352', '2');
insert into basket values('10003', 'aoung', '5072', '1');
insert into basket values('10004', 'coung', '8162', '3');

select * from pay;
/*
결제						
결제번호	아이디	주문번호	결제수단	결제 수단 번호	결제금액	결제일
10001	boung	1001	계좌이체	123-45678-90	28400	2023-03-30
10002	doung	1002	신용카드	50-1234-4567-789	19800	2023-04-02
10003	coung	1003	체크카드	80-8020-9061-66	13900	2023-04-17
10004	koung	1004	카카오페이	490-8135-60-99	15900	2023-04-19
*/

insert into pay values('10001', 'boung', '1001', '계좌이체', '123-45678-90', '28400', '2023-03-30');
insert into pay values('10002', 'doung', '1002', '신용카드', '50-1234-4567-789', '19800', '2023-04-02');
insert into pay values('10003', 'coung', '1003', '체크카드', '80-8020-9061-66', '13900', '2023-04-17');
insert into pay values('10004', 'koung', '1004', '카카오페이', '490-8135-60-99', '15900', '2023-04-19');

select * from latter;
/*
이용후기					
	아이디	주문번호	작성일	이용후기	별점
10001	doung	1002	2023-04-05	옷 너무 예뻐요!	4
10002	koung	1004	2023-04-15	너무 마음에 들어요 또 구매할게요!	5
*/

insert into latter values('10001', 'doung', '1002', '2023-04-05', '옷 너무 예뻐요!', '4');
insert into latter values('10002', 'doung', '1004', '2023-04-15', '너무 마음에 들어요. 또 구매할게요!', '5');


